pin_it/app/views/application/_pin_card.html.erb

<div class="card">
  <%= link_to(show_pin_path(Pin.find(pin.id))) do %>
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]