pin_it/app/views/pins/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
        <p class="lead p-2 mb-auto"><%= @pin.tag %></p>
        <p class="card-text p-2 mb-auto">Created by <%= User.find(@pin.user_id).name_surname %></p>

SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = ?  [["pin_id", 1]]
---
  <div class="container mt-5">
    <% if (@pin.comments.length == 0) %>