pin_it/app/controllers/account_controller.rb

  def pins
    @pins = Pin.all
---
SELECT "pins".* FROM "pins"