pin_it/app/controllers/pins_controller.rb

  def index
    if (session[:user_id] == nil)
      @disabled_account_path = false
    end

    if (params[:q].nil? || params[:q].empty?)
      @search_term = "everything"
      @pins = Pin.all
---
SELECT "pins".* FROM "pins" WHERE ((title LIKE '%w%') OR (tag LIKE '%w%'))

  def create
    user = User.find(session[:user_id])
    @pin = Pin.new(pins_resource_params)
    @pin.user = user
    if (@pin.save)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "pins" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-10-04 16:03:36.265828"], ["updated_at", "2020-10-04 16:03:36.265828"]]

  def show
    id = params[:id]
    @pin = Pin.find(id)
    @comment = Comment.new

    @display_add_comment = session[:user_id].present?

    if(session[:user_id].present?)
      @user = User.find(session[:user_id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]

  def edit
    id = params[:id]
    @pin = Pin.find(id)
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @pin = Pin.find(params[:id])
    if(@pin.update(pins_resource_params))
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pins" SET "title" = ?, "tag" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["title", "title 2"], ["tag", "tag2"], ["updated_at", "2020-10-04 16:17:27.763545"], ["id", 14]]